brew "apktool"          # Android APK reverse engineering
brew "atuin"            # Shell history with sync and search
brew "autoenv"          # Auto-load .env on cd
brew "bash"             # Newer GNU bash than macOS
brew "bwm-ng"           # Live bandwidth/IO monitor
brew "cloudflared"      # Cloudflare Tunnel client
brew "dotnet"           # .NET SDK and runtime
brew "gh"               # GitHub command-line interface
brew "ghostscript"      # PostScript/PDF interpreter
brew "go"
brew "gstreamer"        # Multimedia processing library
brew "htop"             # Interactive process viewer
brew "imagemagick"      # Image manipulation CLI
brew "jadx"             # Android dex/APK decompiler
brew "magic-wormhole"   # Secure encrypted file transfer
brew "mas"              # Mac App Store CLI
brew "nmap"             # Network port scanner
brew "node"
brew "nvm"
brew "ollama"           # Run LLMs locally
brew "openjdk"
brew "opentofu"         # Open-source Terraform fork
brew "pngpaste"         # Paste macOS clipboard images to PNG files
brew "postgresql@17"
brew "protobuf"
brew "python"
brew "redis"
brew "rust"
brew "scrcpy"           # Android screen mirror over USB
brew "spaceman-diff"    # Diff images in git
brew "spark"            # Sparklines for the shell
brew "tmux"
brew "tokei"            # Fast lines-of-code counter
brew "uv"               # Fast Python package manager
brew "wget"
brew "ykman"            # YubiKey CLI tool
brew "yt-dlp"           # Video downloader (youtube-dl fork)
brew "zbar"             # Barcode and QR reader
brew "zsh"

cask_args appdir: "/Applications"
cask "android-platform-tools"   # adb, fastboot for Android
cask "antigravity"              # Google Antigravity CLI (agy)
cask "autodesk-fusion"
cask "bambu-studio"
cask "beeper"                   # Unified chat client (Matrix, etc.)
cask "bettercapture"            # Screen recorder
cask "bitwarden"
cask "caffeine"                 # Keep Mac awake
cask "cameracontroller"         # Control USB cameras, fix C920s autofocus
cask "codex"                    # OpenAI Codex CLI
cask "conductor"                # Manage parallel Claude Code sessions
cask "copilot-cli"
cask "cursor"
cask "diffusionbee"             # Local Stable Diffusion GUI
cask "docker-desktop"
cask "eqmac"                    # System-wide audio equalizer
cask "force-paste"              # Enable paste in restricted fields
cask "ghostty"
cask "gimp"
cask "google-chrome"
cask "granola"
cask "handbrake-app"
cask "home-assistant"           # Companion app
cask "iina"                     # macOS-native video player (mpv-based)
cask "karabiner-elements"       # Keyboard remapping tool
cask "keka"                     # Archive compressor and extractor
cask "keymapp"                  # ZSA keyboard configurator
cask "lulu"                     # Outbound network firewall
cask "meetingbar"
cask "microsoft-edge"
cask "obsidian"
cask "openmtp"                  # Android MTP file browser
cask "orcaslicer"
cask "plex"
cask "proxyman"                 # HTTP debugging proxy
cask "quicklook-video"          # Video thumbnails/metadata
cask "raycast"
cask "scroll-reverser"          # Better experience with trackpad+mouse
cask "sleep-aid"                # Mac sleep monitor
cask "spotify"
cask "steam"
cask "syncthing-app"
cask "tailscale-app"
cask "telegram"
cask "tigervnc-viewer"          # VNC remote desktop client
cask "todoist-app"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "windows-app"              # Microsoft Remote Desktop client
cask "wispr-flow"
cask "xquartz"                  # X11 server for macOS
cask "yubico-authenticator"     # YubiKey GUI manager
cask "zed"                      # Fast collaborative editor
cask "zen"                      # Privacy browser (Firefox-based)
cask "zenmap"                   # Nmap graphical frontend
cask "zoom"
