tap "homebrew/bundle"
tap "whatpulse/whatpulse"

brew "apktool"
brew "autoenv"
brew "bwm-ng"
brew "cloudflared"
brew "dotnet"
brew "firefox"
brew "gh"
brew "ghostscript"
brew "gstreamer"
brew "htop"
brew "imagemagick"
brew "jadx"
brew "nmap"
brew "node"
brew "npm"
brew "ollama"
brew "openjdk"
brew "pipx"
brew "postgresql@14"
brew "powershell"
brew "protobuf"
brew "python"
brew "redis"
brew "rtl_433"
brew "rust"
brew "scrcpy"
brew "spaceman-diff"
brew "spark"
brew "uv"
brew "wget"
brew "yarn"
brew "yt-dlp"
brew "zbar"
brew "zsh"

cask_args appdir: "/Applications"
cask "aldente"
cask "android-platform-tools"
cask "azure-data-studio"
cask "beeper"
cask "caffeine"
cask "diffusionbee"
cask "docker-desktop"
cask "firefox"
cask "force-paste"
cask "ghostty"
cask "gimp"
cask "google-chrome"
cask "gstreamer"
cask "handbrake"
cask "karabiner-elements"
cask "keka"
cask "lulu"
cask "microsoft-edge"
cask "microsoft-remote-desktop"
cask "openmtp"
cask "orcaslicer"
cask "plex"
cask "powershell"
cask "protobuf"
cask "raycast"
cask "scroll-reverser"
cask "spotify"
cask "syncthing-app"
cask "syncthing"
cask "tailscale-app"
cask "tailscale"
cask "tigervnc-viewer"
cask "todoist-app"
cask "todoist"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "whatpulse_chmodbpf"
cask "whatpulse/whatpulse/whatpulse"
cask "xquartz"
cask "zed"
cask "zenmap"
cask "zoom"
cask "rust"