cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'cloudflared'
brew 'firefox'
brew 'imagemagick'
brew 'npm'
brew 'postgresql@14'
brew 'redis'
brew 'spaceman-diff'
brew 'spark'
brew 'wget'
brew 'yt-dlp'
brew 'powershell'
brew 'dotnet'

cask 'aldente'
cask 'android-platform-tools'
cask 'azure-data-studio'
cask 'beeper'
cask 'diffusionbee'
cask 'google-chrome'
cask 'handbrake'
cask 'microsoft-edge'
cask 'microsoft-remote-desktop'
cask 'orcaslicer'
cask 'plex'
cask 'raycast'
cask 'spotify'
cask 'syncthing'
cask 'tailscale'
cask 'todoist'
cask 'visual-studio-code'
cask 'vlc'
cask 'warp'
cask 'whatpulse/whatpulse/whatpulse'
cask 'zed'
cask 'zoom'
cast 'rust'
cask 'protobuf'
cask 'gstreamer'
cask 'xquartz'
